In [1]:
#AIT 726-DL1
#Professor: Dr. Lindi Liao
#Project Baseline Solution
#Title: LLMs for Software Engineering -- Code Generation Using LLMs and Evaluation
#Project Team 5
#Mukesh Rajmohan - G01456275
#Utkarsh Jayesh Desai- G01419940
#Praneeth Ravirala - G01448129

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
#Importing Required Libraries
import pandas as pd
from sklearn.model_selection import train_test_split
import torch
from torch.utils.data import DataLoader, TensorDataset, RandomSampler
from transformers import T5Tokenizer, T5ForConditionalGeneration, AdamW

In [ ]:
print(torch.cuda.is_available())
print(torch.cuda.current_device())
print(torch.cuda.get_device_name(0))

True
0
Tesla T4

In [ ]:
#Importing the dataset
data=pd.read_csv('/content/drive/MyDrive/Colab Notebooks/sql_code_dataset.csv')

In [ ]:
#Retrieving the structure of the dataset
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78577 entries, 0 to 78576
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   question  78577 non-null  object
 1   context   78577 non-null  object
 2   answer    78577 non-null  object
dtypes: object(3)
memory usage: 1.8+ MB

In [ ]:
#Due to limited computing resources, we are taking subset containing 10000 samples
data1=data[:10000]

In [ ]:
#Splitting Dataset into Training and Testing with 80% training data and 20% Testing Data
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(data1[['question','context']],
                                                    data1['answer'], test_size=0.2, random_state=42)

In [ ]:
#Structure of Train Data
x_train.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8000 entries, 9254 to 7270
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   question  8000 non-null   object
 1   context   8000 non-null   object
dtypes: object(2)
memory usage: 187.5+ KB

In [ ]:
#Splitting the Input "Question" and "Context" to give for Tokenizer as a pair
context_train=x_train['context']
context_test=x_test['context']
x_train=x_train['question']
x_test=x_test['question']

In [ ]:
device = torch.device("cuda" if torch.cuda.is_available() else "cpu")

In [ ]:
#Defining T5 Transformer Model and its tokenizer for encoding and decoding operations.
T5Tokenizer = T5Tokenizer.from_pretrained('t5-base')
T5Model = T5ForConditionalGeneration.from_pretrained('t5-base').to(device)

/usr/local/lib/python3.10/dist-packages/huggingface_hub/utils/_auth.py:94: UserWarning:
The secret `HF_TOKEN` does not exist in your Colab secrets.
To authenticate with the Hugging Face Hub, create a token in your settings tab (https://huggingface.co/settings/tokens), set it as secret in your Google Colab and restart your session.
You will be able to reuse this secret in all of your notebooks.
Please note that authentication is recommended but still optional to access public models or datasets.
  warnings.warn(

spiece.model:   0%|          | 0.00/792k [00:00<?, ?B/s]

tokenizer.json:   0%|          | 0.00/1.39M [00:00<?, ?B/s]

config.json:   0%|          | 0.00/1.21k [00:00<?, ?B/s]

You are using the default legacy behaviour of the <class 'transformers.models.t5.tokenization_t5.T5Tokenizer'>. This is expected, and simply means that the `legacy` (previous) behavior will be used so nothing changes for you. If you want to use the new behaviour, set `legacy=False`. This should only be set if you understand what it means, and thoroughly read the reason why this was added as explained in https://github.com/huggingface/transformers/pull/24565

model.safetensors:   0%|          | 0.00/892M [00:00<?, ?B/s]

generation_config.json:   0%|          | 0.00/147 [00:00<?, ?B/s]

In [ ]:
#Tokenising input "question" and "context" pair into tokens and encoding tokens for both training and testing datasets.
#The returned encoded data is in tensor 2D list format and each each list contains max 512 tokens.
x_train_encoded = T5Tokenizer(x_train.tolist(), context_train.tolist(), padding=True, truncation=True,
                              return_tensors='pt', max_length=512).to(device)
x_test_encoded = T5Tokenizer(x_test.tolist(), context_test.tolist(), padding=True, truncation=True,
                             return_tensors='pt', max_length=512).to(device)

In [ ]:
#Tokenising input "question" and "context" pair into tokens and encoding tokens for both training and testing datasets.
#The returned encoded data is in tensor 2D list format and each each list contains max 512 tokens.
x_train_encoded = T5Tokenizer(x_train.tolist(), context_train.tolist(), padding=True, truncation=True,
                              return_tensors='pt', max_length=512).to(device)
x_test_encoded = T5Tokenizer(x_test.tolist(), context_test.tolist(), padding=True, truncation=True,
                             return_tensors='pt', max_length=512).to(device)

In [ ]:
#Similarily tokenising and encoding the train label
y_train_encoded = T5Tokenizer(y_train.tolist(),padding=True, truncation=True, return_tensors='pt', max_length=512).to(device)

In [ ]:
#The Encoded data contains the ids of tokens and attention mask which describes the importance of tokens.
y_train_encoded

{'input_ids': tensor([[    3, 23143, 14196,  ...,     0,     0,     0],
        [    3, 23143, 14196,  ...,     0,     0,     0],
        [    3, 23143, 14196,  ...,     0,     0,     0],
        ...,
        [    3, 23143, 14196,  ...,     0,     0,     0],
        [    3, 23143, 14196,  ...,     0,     0,     0],
        [    3, 23143, 14196,  ...,     0,     0,     0]], device='cuda:0'), 'attention_mask': tensor([[1, 1, 1,  ..., 0, 0, 0],
        [1, 1, 1,  ..., 0, 0, 0],
        [1, 1, 1,  ..., 0, 0, 0],
        ...,
        [1, 1, 1,  ..., 0, 0, 0],
        [1, 1, 1,  ..., 0, 0, 0],
        [1, 1, 1,  ..., 0, 0, 0]], device='cuda:0')}

In [ ]:
#Transform the input and label pair to a tensor dataset supported by pytorch
Transform_Train_Tensor = TensorDataset(x_train_encoded['input_ids'], x_train_encoded['attention_mask'],
                                       y_train_encoded['input_ids'])
#Randomly Sample the dataset to batches for parallel processing based on given batch size
Sample_Train_Tensor = RandomSampler(Transform_Train_Tensor)
Load_Train_Batches = DataLoader(Transform_Train_Tensor, sampler=Sample_Train_Tensor, batch_size=8)
#Defining Optimizer to update the weights and minimising the loss function
T5ModelOptimizer = torch.optim.AdamW(T5Model.parameters(), lr=2e-5)

In [ ]:
# Defining the training function which does the following:
# Set Epochs to 2
#Iterating through batches
#For each batch computing weights based on input_id, attention_mask and label of that corresponding batch
#computing loss function for the corresponding batch
#computing gradient and updating weights by backpropogating to minimize overall loss function.
T5Model.train()
for i in range(2):
    epoch_loss = 0
    for b in Load_Train_Batches:
        input_id_batch=b[0]
        attention_mask_batch=b[1]
        label_batch = b[2]
        outputs_weights_batch=T5Model(input_ids=input_id_batch,attention_mask=attention_mask_batch,labels=label_batch)
        batch_loss = outputs_weights_batch.loss
        epoch_loss = epoch_loss+batch_loss.item()
        batch_loss.backward()
        T5ModelOptimizer.step()
        T5Model.zero_grad()
        torch.cuda.empty_cache()

    Average_Epoch_Loss = epoch_loss / len(Load_Train_Batches)
    print('Epoch '+str(i)+' Loss = '+str(Average_Epoch_Loss))

Passing a tuple of `past_key_values` is deprecated and will be removed in Transformers v4.48.0. You should pass an instance of `EncoderDecoderCache` instead, e.g. `past_key_values=EncoderDecoderCache.from_legacy_cache(past_key_values)`.

Epoch 0 Loss = 0.4777791198454797
Epoch 1 Loss = 0.07594330419041216

In [ ]:
#Predicting 100 Samples is taking more than 40 GB of GPU RAM which is not feasible with our resources
#So we decided to take subset of test data with 200 samples for predicting the code.
x_test_encoded1=x_test_encoded[:500]

In [ ]:
x_test_encoded1

{'input_ids': tensor([[ 366,  968, 5865,  ...,    0,    0,    0],
         [ 363,   19,    8,  ...,    0,    0,    0],
         [8298,   66,    8,  ...,    0,    0,    0],
         ...,
         [2588,    8, 3056,  ...,    0,    0,    0],
         [ 570, 3056,   13,  ...,    0,    0,    0],
         [ 549,  107,    3,  ...,    0,    0,    0]], device='cuda:0'),
 'attention_mask': tensor([[1, 1, 1,  ..., 0, 0, 0],
         [1, 1, 1,  ..., 0, 0, 0],
         [1, 1, 1,  ..., 0, 0, 0],
         ...,
         [1, 1, 1,  ..., 0, 0, 0],
         [1, 1, 1,  ..., 0, 0, 0],
         [1, 1, 1,  ..., 0, 0, 0]], device='cuda:0')}

In [ ]:
T5Model.eval()
with torch.no_grad():
    all_outputs = []
    for i in range(500):
        generated_output = T5Model.generate(
            input_ids=x_test_encoded1['input_ids'][i:i+1].to(device),
            attention_mask=x_test_encoded1['attention_mask'][i:i+1].to(device),
            max_length=100,
            num_beams=5,
            early_stopping=True
        )
        all_outputs.append(generated_output)
        torch.cuda.empty_cache()

In [ ]:
predicted_code=[]
for i in all_outputs:
  pred=T5Tokenizer.decode(i[0], skip_special_tokens=True, clean_up_tokenization_spaces=True)
  predicted_code.append(pred)
for input_text, code in zip(y_test, predicted_code):
    print(f"Input: {input_text}\nGenerated Code:\n{code}\n")

Input: SELECT assembled FROM table_1827690_4 WHERE elected = "1472"
Generated Code:
SELECT assembled FROM table_1827690_4 WHERE elected = "1472"

Input: SELECT willow_canyon FROM table_11340432_1 WHERE shadow_ridge = "Stallion"
Generated Code:
SELECT willow_canyon FROM table_11340432_1 WHERE shadow_ridge = "Stallion"

Input: SELECT fname, lname FROM authors ORDER BY lname
Generated Code:
SELECT fname, lname FROM authors WHERE alphabetical order of last names

Input: SELECT gvm__kg__technical_capacity FROM table_11497980_1 WHERE model = "15.180E"
Generated Code:
SELECT gvm__kg__technical_capacity FROM table_11497980_1 WHERE model = "15.180e"

Input: SELECT school_club_team FROM table_10015132_16 WHERE years_in_toronto = "1995-96"
Generated Code:
SELECT school_club_team FROM table_10015132_16 WHERE years_in_toronto = 1995-96

Input: SELECT minor_sponsors FROM table_187239_1 WHERE kit_manufacturer = "Olympikus" AND main_sponsor = "Batavo"
Generated Code:
SELECT minor_sponsors FROM table_187239_1 WHERE kit_manufacturer = "batavo" AND main_sponsor = "olympikus"

Input: SELECT DISTINCT T2.Hardware_Model_name FROM screen_mode AS T1 JOIN phone AS T2 ON T1.Graphics_mode = T2.screen_mode WHERE T1.Type = "Graphics" OR t2.Company_name = "Nokia Corporation"
Generated Code:
SELECT T1.Hardware_Model_name FROM phone AS T1 JOIN screen_mode AS T2 ON T1.Graphics_mode = T2.Graphics_mode GROUP BY T1.Hardware_Model_name ORDER BY COUNT(*) DESC LIMIT 1

Input: SELECT district FROM table_1341843_19 WHERE incumbent = "F. Edward Hebert"
Generated Code:
SELECT district FROM table_1341843_19 WHERE incumbent = "F. Edward Hebert"

Input: SELECT MIN(used__kb_) FROM table_18950885_3 WHERE graphics_mode = 4
Generated Code:
SELECT used__kb_ FROM table_18950885_3 WHERE graphics_mode = "4"

Input: SELECT Membership_card FROM member GROUP BY Membership_card HAVING COUNT(*) > 5
Generated Code:
SELECT MEMBER_card FROM member WHERE Membership_card > 5

Input: SELECT product_id FROM Order_Items GROUP BY product_id HAVING COUNT(*) > 3 UNION SELECT product_id FROM Product_Suppliers GROUP BY product_id HAVING SUM(total_amount_purchased) > 80000
Generated Code:
SELECT T1.product_id FROM Order_Items AS T1 JOIN Product_Suppliers AS T2 ON T1.product_id = T2.product_id WHERE T2.total_amount_purchased  80000

Input: SELECT MIN(assists) FROM table_25016555_5
Generated Code:
SELECT COUNT(assists) FROM table_25016555_5

Input: SELECT date FROM table_13464416_8 WHERE team = "Chicago"
Generated Code:
SELECT date FROM table_13464416_8 WHERE team = "Chicago"

Input: SELECT MIN(attendance) FROM table_15173650_2
Generated Code:
SELECT MIN(attendance) FROM table_15173650_2 WHERE attendance = "Least Attendance"

Input: SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype
Generated Code:
SELECT COUNT(pettype) FROM pets ORDER BY pet_age

Input: SELECT team FROM table_17102076_9 WHERE date = "March 20"
Generated Code:
SELECT team FROM table_17102076_9 WHERE date = "March 20"

Input: SELECT COUNT(*) FROM chip_model WHERE wifi = 'No'
Generated Code:
SELECT COUNT(wifi) FROM chip_model WHERE wifi = "wifi"

Input: SELECT season FROM table_name_54 WHERE champion = "juventus"
Generated Code:
SELECT season FROM table_name_54 WHERE champion = "Juventus"

Input: SELECT unemployment_rate FROM table_22815568_7 WHERE status = "Transitional" AND county = "Alexander"
Generated Code:
SELECT unemployment_rate FROM table_22815568_7 WHERE status = "transitional" AND county = "Alexander"

Input: SELECT COUNT(standard) FROM table_2780146_6 WHERE pm__g_kwh_ = "0.02"
Generated Code:
SELECT standard FROM table_2780146_6 WHERE pm__g_kwh_ = "0.02 g/kWh"

Input: SELECT designation FROM table_name_56 WHERE manufacturer = "siemens" AND quantity = 52
Generated Code:
SELECT designation FROM table_name_56 WHERE manufacturer = "Siemens" AND quantity = "52"

Input: SELECT COUNT(*) FROM Students WHERE NOT student_id IN (SELECT student_id FROM Student_Course_Enrolment)
Generated Code:
SELECT COUNT(*) FROM Students AS T1 JOIN Student_Course_Enrolment AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY COUNT(*) DESC LIMIT 1

Input: SELECT staten_island FROM table_1108394_6 WHERE the_bronx = "1,281"
Generated Code:
SELECT staten_island FROM table_1108394_6 WHERE the_bronx = "1,281"

Input: SELECT MAX(ends_lost) FROM table_name_11 WHERE locale = "ontario"
Generated Code:
SELECT MAX(ends_lost) FROM table_name_11 WHERE locale = "Ontario"

Input: SELECT cover_date FROM table_1217448_1 WHERE character_s_ = "X-Men ; Magneto"
Generated Code:
SELECT cover_date FROM table_1217448_1 WHERE character_s_ = "x-men"

Input: SELECT MAX(area_1996_km²) FROM table_name_91 WHERE pop_1999 = "17,510" AND area_2006_km² > 30
Generated Code:
SELECT area_1996_km2 FROM table_name_91 WHERE pop_1999 > 30 AND area_2006_km2 > 30

Input: SELECT T2.dept_name FROM student AS T1 JOIN department AS T2 ON T1.dept_code = T2.dept_code ORDER BY stu_gpa LIMIT 1
Generated Code:
SELECT T1.dept_name FROM student AS T1 JOIN department AS T2 ON T1.dept_code = T2.dept_code GROUP BY T1.dept_code

Input: SELECT network FROM table_28190363_1 WHERE judges = "Batuhan Zeynioğlu Piatti Murat Bozok Erol Kaynar"
Generated Code:
SELECT network FROM table_28190363_1 WHERE judges = "batuhan zeyniolu piatti murat bozok erol kaynar"

Input: SELECT dates_administered FROM table_20032301_3 WHERE poll_source = "Minnesota Poll"
Generated Code:
SELECT dates_administered FROM table_20032301_3 WHERE poll_source = "Minnesota Poll"

Input: SELECT MIN(overall) FROM table_name_58 WHERE school_club_team = "arizona state"
Generated Code:
SELECT COUNT(overall) FROM table_name_58 WHERE school_club_team = "arizona state"

Input: SELECT COUNT(*) FROM customers WHERE state = "CA"
Generated Code:
SELECT COUNT(*) FROM customers

Input: SELECT T2.customer_name FROM mailshot_customers AS T1 JOIN customers AS T2 ON T1.customer_id = T2.customer_id GROUP BY T1.customer_id ORDER BY COUNT(*) DESC LIMIT 1
Generated Code:
SELECT T1.customer_name FROM customers AS T1 JOIN mailshot_customers AS T2 ON T1.customer_id = T2.customer_id GROUP BY T1.customer_id ORDER BY COUNT(*) DESC LIMIT 1

Input: SELECT compatible_with_60gb_pal_80gb_ntsc_ps3__cechc_ceche_ FROM table_10875694_11 WHERE publisher = "Electronic Arts" AND title = "James Bond 007: Agent Under Fire"
Generated Code:
SELECT compatible_with_60gb_pal_80gb_ntsc_ps3__cechc_ceche_ FROM table_10875694_11 WHERE publisher = "James Bond 007: Agent Under Fire" AND title = "Agent Under Fire"

Input: SELECT result FROM table_12175755_1 WHERE theme = "Finale" AND order__number = "3"
Generated Code:
SELECT result FROM table_12175755_1 WHERE theme = "#3" AND order__number = "#4"

Input: SELECT track FROM table_28715942_5 WHERE vocal_percussionist = "unknown"
Generated Code:
SELECT track FROM table_28715942_5 WHERE vocal_percussionist = "unknown"

Input: SELECT COUNT(DISTINCT transaction_type_code) FROM TRANSACTIONS
Generated Code:
SELECT COUNT(transaction_type_code) FROM TRANSACTIONS

Input: SELECT COUNT(population_1891) FROM table_14925084_1 WHERE area_1891__statute_acres_ = 175836
Generated Code:
SELECT population_1891 FROM table_14925084_1 WHERE area_1891__statute_acres_ = "175836"

Input: SELECT COUNT(DISTINCT allergy) FROM Allergy_type
Generated Code:
SELECT COUNT(allergy) FROM Allergy_type

Input: SELECT t2.name, t2.capacity FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year > 2013 GROUP BY t2.stadium_id ORDER BY COUNT(*) DESC LIMIT 1
Generated Code:
SELECT T1.name, T1.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year = 2013

Input: SELECT rating / SHARE(18 - 49) FROM table_20522228_2 WHERE viewers__millions_ = "5.50"
Generated Code:
SELECT ratings FROM table_20522228_2 WHERE viewers__millions_ = "5.50 Million"

Input: SELECT college FROM table_14655757_1 WHERE player = "Byron Williams"
Generated Code:
SELECT college FROM table_14655757_1 WHERE player = "Byron Williams"

Input: SELECT Census_Ranking FROM city WHERE Status <> "Village"
Generated Code:
SELECT Census_Ranking FROM city WHERE Status = "Not Village"

Input: SELECT player FROM table_2886617_9 WHERE nhl_team = "St. Louis Blues"
Generated Code:
SELECT player FROM table_2886617_9 WHERE nhl_team = "St. Louis Blues"

Input: SELECT T1.White, T2.Crime_rate FROM city AS T1 JOIN county_public_safety AS T2 ON T1.County_ID = T2.County_ID
Generated Code:
SELECT T1.White FROM city AS T1 JOIN county_public_safety AS T2 ON T1.Crime_rate = T2.Crime_rate WHERE T2.County_ID = "White"

Input: SELECT MIN(tier) FROM table_name_68 WHERE postseason = "quarterfinalist"
Generated Code:
SELECT tier FROM table_name_68 WHERE postseason = "quarterfinalist"

Input: SELECT student_id FROM students WHERE NOT student_id IN (SELECT student_id FROM student_course_attendance)
Generated Code:
SELECT T1.student_id FROM students AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY COUNT(*) DESC LIMIT 1

Input: SELECT interview FROM table_11690135_1 WHERE evening_gown = "9.78"
Generated Code:
SELECT interview FROM table_11690135_1 WHERE evening_gown = "9.78"

Input: SELECT country FROM addresses GROUP BY country HAVING COUNT(address_id) > 4
Generated Code:
SELECT country FROM addresses WHERE address_id > 4

Input: SELECT COUNT(*) FROM store
Generated Code:
SELECT COUNT(*) FROM store

Input: SELECT DISTINCT T2.name FROM undergoes AS T1 JOIN nurse AS T2 ON T1.AssistingNurse = T2.EmployeeID
Generated Code:
SELECT T1.name FROM nurse AS T1 JOIN nurse AS T2 ON T1.EmployeeID = T2.AssistingNurse GROUP BY T1.EmployeeID

Input: SELECT T1.Color FROM GRAPES AS T1 JOIN WINE AS T2 ON T1.Grape = T2.Grape GROUP BY T2.Grape ORDER BY AVG(Price) DESC LIMIT 1
Generated Code:
SELECT COUNT(*) FROM GRAPES AS T1 JOIN WINE AS T2 ON T1.Color = T2.Grape WHERE T1.Color = "wine" AND T2.Grape = "wine"

Input: SELECT gender FROM table_28523_2 WHERE school = "Cunningham Hill Infant school"
Generated Code:
SELECT gender FROM table_28523_2 WHERE school = "Cunningham Hill Infant School"

Input: SELECT 1 AS st_leg FROM table_1233026_4 WHERE club = "A.C. Libertas"
Generated Code:
SELECT club FROM table_1233026_4 WHERE club = "a.c. libertas"

Input: SELECT high_assists FROM table_27723526_10 WHERE date = "January 27"
Generated Code:
SELECT high_assists FROM table_27723526_10 WHERE date = "january 27"

Input: SELECT name, price FROM products
Generated Code:
SELECT name, price FROM products WHERE price = "all"

Input: SELECT directed_by FROM table_26914076_4 WHERE us_viewers__millions_ = "0.57"
Generated Code:
SELECT directed_by FROM table_26914076_4 WHERE us_viewers__millions_ = "0.057"

Input: SELECT * FROM products AS T1 JOIN Manufacturers AS T2 ON T1.manufacturer = T2.code
Generated Code:
SELECT T1.manufacturer FROM products AS T1 JOIN manufacturers AS T2 ON T1.manufacturer = T2.manufacturer GROUP BY T1.manufacturer

Input: SELECT tournament FROM table_name_7 WHERE date = "october 1, 2006"
Generated Code:
SELECT tournament FROM table_name_7 WHERE date = "October 1, 2006"

Input: SELECT AVG(age), job FROM Person WHERE gender = 'male' GROUP BY job
Generated Code:
SELECT job FROM Person WHERE age = "Male" AND gender = "male"

Input: SELECT document_type_code FROM documents GROUP BY document_type_code HAVING COUNT(*) > 4
Generated Code:
SELECT document_type_code FROM documents WHERE document_type_code > 4

Input: SELECT T2.Name FROM phone_market AS T1 JOIN phone AS T2 ON T1.Phone_ID = T2.Phone_ID GROUP BY T2.Name HAVING SUM(T1.Num_of_stock) >= 2000 ORDER BY SUM(T1.Num_of_stock) DESC
Generated Code:
SELECT T1.Name FROM phone AS T1 JOIN phone_market AS T2 ON T1.Phone_ID = T2.Phone_ID GROUP BY T1.Phone_ID ORDER BY COUNT(*) DESC LIMIT 1

Input: SELECT date_of_appointment FROM table_27114708_2 WHERE team = "Ascoli"
Generated Code:
SELECT date_of_appointment FROM table_27114708_2 WHERE team = "Ascoli"

Input: SELECT high_assists FROM table_17288845_9 WHERE team = "Houston"
Generated Code:
SELECT high_assists FROM table_17288845_9 WHERE team = "houston"

Input: SELECT id FROM trip WHERE duration >= (SELECT AVG(duration) FROM trip WHERE zip_code = 94103)
Generated Code:
SELECT id FROM trip ORDER BY duration DESC LIMIT 1

Input: SELECT COUNT(DISTINCT driverId) FROM results WHERE NOT raceId IN (SELECT raceId FROM races WHERE YEAR <> 2009)
Generated Code:
SELECT T1.driverId FROM races AS T1 JOIN results AS T2 ON T1.driverId = T2.driverId WHERE T1.raceId = "2009" AND T2.year = "2009"

Input: SELECT race FROM table_27913160_3 WHERE most_laps_led = "Simon Pagenaud"
Generated Code:
SELECT race FROM table_27913160_3 WHERE most_laps_led = "Simon Pagenaud"

Input: SELECT AVG(total_amount_purchased), AVG(total_value_purchased) FROM Product_Suppliers WHERE supplier_id = (SELECT supplier_id FROM Product_Suppliers GROUP BY supplier_id ORDER BY COUNT(*) DESC LIMIT 1)
Generated Code:
SELECT average_amount_purchased, total_value_purchased FROM Product_Suppliers WHERE supplier_id = "The supplier who supplies the most products"

Input: SELECT MAX(points) FROM table_name_62 WHERE drawn = 0 AND games > 5
Generated Code:
SELECT points FROM table_name_62 WHERE drawn > 0 AND games > 5

Input: SELECT wednesday FROM table_18173916_8 WHERE thursday = "438 Magic: The Gathering Mini Masters Tournament"
Generated Code:
SELECT wednesday FROM table_18173916_8 WHERE thursday = "438 magic: the gathering mini masters tournament"

Input: SELECT T1.pName FROM player AS T1 JOIN tryout AS T2 ON T1.pID = T2.pID WHERE T2.decision = 'yes' AND T2.pPos = 'striker'
Generated Code:
SELECT T1.pName, T2.pPos FROM player AS T1 JOIN tryout AS T2 ON T1.pID = T2.pID GROUP BY T1.pID ORDER BY COUNT(*) DESC LIMIT 1

Input: SELECT gtu_winning_team FROM table_13642023_2 WHERE to_winning_team = "Steve Ross"
Generated Code:
SELECT gtu_winning_team FROM table_13642023_2 WHERE to_winning_team = "Steve Ross"

Input: SELECT T1.title, T3.name FROM course AS T1 JOIN teaches AS T2 ON T1.course_id = T2.course_id JOIN instructor AS T3 ON T2.id = T3.id WHERE YEAR = 2008 ORDER BY T1.title
Generated Code:
SELECT T1.name FROM course AS T1 JOIN instructor AS T2 ON T1.course_id = T2.course_id WHERE T1.id = "2008"

Input: SELECT T1.city FROM city AS T1 JOIN temperature AS T2 ON T1.city_id = T2.city_id WHERE T2.Mar < T2.Dec EXCEPT SELECT T3.city FROM city AS T3 JOIN hosting_city AS T4 ON T3.city_id = T4.host_city
Generated Code:
SELECT T1.city FROM city AS T1 JOIN hosting_city AS T2 ON T1.city_id = T2.city_id GROUP BY T2.city_id ORDER BY COUNT(*) DESC LIMIT 1

Input: SELECT cName FROM college WHERE enr > (SELECT MAX(enr) FROM college WHERE state = 'FL')
Generated Code:
SELECT cName FROM college ORDER BY state ORDER BY COUNT(*) DESC LIMIT 1

Input: SELECT DISTINCT Product_Name FROM PRODUCTS WHERE Product_Price > (SELECT AVG(Product_Price) FROM PRODUCTS)
Generated Code:
SELECT PRODUCT_Name FROM PRODUCTS WHERE Product_Price > (SELECT PRODUCT_Name FROM PRODUCTS)

Input: SELECT high_points FROM table_27902171_6 WHERE team = "Utah Jazz"
Generated Code:
SELECT high_points FROM table_27902171_6 WHERE team = "Utah Jazz"

Input: SELECT COUNT(*) FROM item WHERE NOT i_id IN (SELECT i_id FROM review)
Generated Code:
SELECT T1.i_id FROM review AS T1 JOIN item AS T2 ON T1.i_id = T2.i_id GROUP BY T1.i_id ORDER BY COUNT(*) DESC LIMIT 1

Input: SELECT MAX(founded) FROM table_2076516_1 WHERE school = "East Carolina University"
Generated Code:
SELECT COUNT(founded) FROM table_2076516_1 WHERE school = "East Carolina University"

Input: SELECT MAX(losses) FROM table_name_62 WHERE percentage > 0.461 AND wins > 86 AND finish = "2nd" AND year = 1953
Generated Code:
SELECT MAX(losses) FROM table_name_62 WHERE year = "1953" AND win = "2nd"

Input: SELECT COUNT(*), t1.name FROM manufacturer AS t1 JOIN furniture_manufacte AS t2 ON t1.manufacturer_id = t2.manufacturer_id GROUP BY t1.manufacturer_id
Generated Code:
SELECT T1.name FROM furniture_manufacte AS T1 JOIN manufacturer AS T2 ON T1.manufacturer_id = T2.manufacturer_id GROUP BY T1.name ORDER BY COUNT(*) DESC LIMIT 1

Input: SELECT MIN(loss) FROM table_name_83 WHERE avg_g = 3.5 AND gain < 42
Generated Code:
SELECT loss FROM table_name_83 WHERE avg_g = "3.5" AND gain = "42"

Input: SELECT T2.name, COUNT(*) FROM exhibition AS T1 JOIN artist AS T2 ON T1.artist_id = T2.artist_id GROUP BY T1.artist_id
Generated Code:
SELECT T1.name FROM artist AS T1 JOIN exhibition AS T2 ON T1.artist_id = T2.artist_id GROUP BY T1.artist_id ORDER BY COUNT(*) DESC LIMIT 1

Input: SELECT high_points FROM table_13812785_8 WHERE high_rebounds = "Charles Oakley (9)"
Generated Code:
SELECT high_points FROM table_13812785_8 WHERE high_rebounds = "Charles Oakley (9)"

Input: SELECT MAX(elevation) FROM airports WHERE country = 'Iceland'
Generated Code:
SELECT MAX(elevation) FROM airports WHERE country = "Iceland"

Input: SELECT MIN(games_played) FROM table_16034882_2
Generated Code:
SELECT MIN(games_played) FROM table_16034882_2 WHERE games_played = "0"

Input: SELECT t1.product_name, t1.typical_buying_price, t1.typical_selling_price FROM products AS t1 JOIN ref_colors AS t2 ON t1.color_code = t2.color_code WHERE t2.color_description = "yellow"
Generated Code:
SELECT T1.product_name, T1.typical_buying_price, T1.typical_selling_price FROM ref_colors AS T1 JOIN products AS T2 ON T1.color_code = T2.color_code WHERE T2.color_description = "yellow"

Input: SELECT t1.first_name FROM staff AS t1 JOIN complaints AS t2 ON t1.staff_id = t2.staff_id GROUP BY t2.staff_id ORDER BY COUNT(*) LIMIT 5
Generated Code:
SELECT T1.first_name FROM complaints AS T1 JOIN staff AS T2 ON T1.staff_id = T2.staff_id GROUP BY T1.staff_id ORDER BY COUNT(*) DESC LIMIT 1

Input: SELECT founder FROM manufacturers WHERE name = 'Sony'
Generated Code:
SELECT founder FROM manufacturers WHERE name = "Sony"

Input: SELECT player FROM table_name_98 WHERE club = "balmain tigers"
Generated Code:
SELECT player FROM table_name_98 WHERE club = "Balmain Tigers"

Input: SELECT MIN(no_in_series) FROM table_2618102_1 WHERE directed_by = "James Quinn"
Generated Code:
SELECT MIN(no_in_series) FROM table_2618102_1 WHERE directed_by = "James Quinn"

Input: SELECT to_par FROM table_247955_2 WHERE winning_score = 69 - 66 - 69 - 64 = 268
Generated Code:
SELECT to_par FROM table_247955_2 WHERE winning_score = "69-66-69-64=268"

Input: SELECT fastest_lap FROM table_26920192_5 WHERE winning_driver = "Giorgio Sanna"
Generated Code:
SELECT fastest_lap FROM table_26920192_5 WHERE winning_driver = "giorgio sanna"

Input: SELECT player FROM table_name_67 WHERE college_junior_club_team = "canterbury (ushs)"
Generated Code:
SELECT player FROM table_name_67 WHERE college_junior_club_team = "Canterbury (ushs)"

Input: SELECT MAX(market_share), MIN(market_share), AVG(market_share) FROM browser
Generated Code:
SELECT MAX(market_share) FROM browser

Input: SELECT COUNT(*) FROM products AS t1 JOIN product_characteristics AS t2 ON t1.product_id = t2.product_id JOIN CHARACTERISTICS AS t3 ON t2.characteristic_id = t3.characteristic_id WHERE t3.characteristic_name = "hot"
Generated Code:
SELECT COUNT(*) FROM products AS T1 JOIN product_characteristics AS T2 ON T1.product_id = T2.product_id WHERE T1.characteristic_name = "hot"

Input: SELECT customer_status_code, COUNT(*) FROM Customers GROUP BY customer_status_code
Generated Code:
SELECT customer_status_code FROM Customers GROUP BY customer_status_code

Input: SELECT series FROM table_name_99 WHERE score = "0–6"
Generated Code:
SELECT series FROM table_name_99 WHERE score = "0–6"

Input: SELECT MAX(public) FROM table_26375386_18 WHERE couple = "Danniella and Matthew"
Generated Code:
SELECT MAX(public) FROM table_26375386_18 WHERE couple = "Steven" AND couple = "Matthew"

Input: SELECT last_appearance FROM table_2517159_1 WHERE name_of_bowl = "Music City Bowl"
Generated Code:
SELECT last_appearance FROM table_2517159_1 WHERE name_of_bowl = "music city bowl"

Input: SELECT score FROM table_23486853_3 WHERE game = 4
Generated Code:

In [ ]:
len(predicted_code)

500

In [ ]:
#Displaying Acutal Test Results and Predicted Test Results.
for test_output, pred_output in zip(y_test[:500], predicted_code):
  print("Test Code Output: "+str(test_output)+"\n"+"Predicted Code Output: "+str(pred_output)+"\n")

Test Code Output: SELECT assembled FROM table_1827690_4 WHERE elected = "1472"
Predicted Code Output: SELECT assembled FROM table_1827690_4 WHERE elected = "1472"

Test Code Output: SELECT willow_canyon FROM table_11340432_1 WHERE shadow_ridge = "Stallion"
Predicted Code Output: SELECT willow_canyon FROM table_11340432_1 WHERE shadow_ridge = "Stallion"

Test Code Output: SELECT fname, lname FROM authors ORDER BY lname
Predicted Code Output: SELECT fname, lname FROM authors WHERE alphabetical order of last names

Test Code Output: SELECT gvm__kg__technical_capacity FROM table_11497980_1 WHERE model = "15.180E"
Predicted Code Output: SELECT gvm__kg__technical_capacity FROM table_11497980_1 WHERE model = "15.180e"

Test Code Output: SELECT school_club_team FROM table_10015132_16 WHERE years_in_toronto = "1995-96"
Predicted Code Output: SELECT school_club_team FROM table_10015132_16 WHERE years_in_toronto = 1995-96

Test Code Output: SELECT minor_sponsors FROM table_187239_1 WHERE kit_manufacturer = "Olympikus" AND main_sponsor = "Batavo"
Predicted Code Output: SELECT minor_sponsors FROM table_187239_1 WHERE kit_manufacturer = "batavo" AND main_sponsor = "olympikus"

Test Code Output: SELECT DISTINCT T2.Hardware_Model_name FROM screen_mode AS T1 JOIN phone AS T2 ON T1.Graphics_mode = T2.screen_mode WHERE T1.Type = "Graphics" OR t2.Company_name = "Nokia Corporation"
Predicted Code Output: SELECT T1.Hardware_Model_name FROM phone AS T1 JOIN screen_mode AS T2 ON T1.Graphics_mode = T2.Graphics_mode GROUP BY T1.Hardware_Model_name ORDER BY COUNT(*) DESC LIMIT 1

Test Code Output: SELECT district FROM table_1341843_19 WHERE incumbent = "F. Edward Hebert"
Predicted Code Output: SELECT district FROM table_1341843_19 WHERE incumbent = "F. Edward Hebert"

Test Code Output: SELECT MIN(used__kb_) FROM table_18950885_3 WHERE graphics_mode = 4
Predicted Code Output: SELECT used__kb_ FROM table_18950885_3 WHERE graphics_mode = "4"

Test Code Output: SELECT Membership_card FROM member GROUP BY Membership_card HAVING COUNT(*) > 5
Predicted Code Output: SELECT MEMBER_card FROM member WHERE Membership_card > 5

Test Code Output: SELECT product_id FROM Order_Items GROUP BY product_id HAVING COUNT(*) > 3 UNION SELECT product_id FROM Product_Suppliers GROUP BY product_id HAVING SUM(total_amount_purchased) > 80000
Predicted Code Output: SELECT T1.product_id FROM Order_Items AS T1 JOIN Product_Suppliers AS T2 ON T1.product_id = T2.product_id WHERE T2.total_amount_purchased  80000

Test Code Output: SELECT MIN(assists) FROM table_25016555_5
Predicted Code Output: SELECT COUNT(assists) FROM table_25016555_5

Test Code Output: SELECT date FROM table_13464416_8 WHERE team = "Chicago"
Predicted Code Output: SELECT date FROM table_13464416_8 WHERE team = "Chicago"

Test Code Output: SELECT MIN(attendance) FROM table_15173650_2
Predicted Code Output: SELECT MIN(attendance) FROM table_15173650_2 WHERE attendance = "Least Attendance"

Test Code Output: SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype
Predicted Code Output: SELECT COUNT(pettype) FROM pets ORDER BY pet_age

Test Code Output: SELECT team FROM table_17102076_9 WHERE date = "March 20"
Predicted Code Output: SELECT team FROM table_17102076_9 WHERE date = "March 20"

Test Code Output: SELECT COUNT(*) FROM chip_model WHERE wifi = 'No'
Predicted Code Output: SELECT COUNT(wifi) FROM chip_model WHERE wifi = "wifi"

Test Code Output: SELECT season FROM table_name_54 WHERE champion = "juventus"
Predicted Code Output: SELECT season FROM table_name_54 WHERE champion = "Juventus"

Test Code Output: SELECT unemployment_rate FROM table_22815568_7 WHERE status = "Transitional" AND county = "Alexander"
Predicted Code Output: SELECT unemployment_rate FROM table_22815568_7 WHERE status = "transitional" AND county = "Alexander"

Test Code Output: SELECT COUNT(standard) FROM table_2780146_6 WHERE pm__g_kwh_ = "0.02"
Predicted Code Output: SELECT standard FROM table_2780146_6 WHERE pm__g_kwh_ = "0.02 g/kWh"

Test Code Output: SELECT designation FROM table_name_56 WHERE manufacturer = "siemens" AND quantity = 52
Predicted Code Output: SELECT designation FROM table_name_56 WHERE manufacturer = "Siemens" AND quantity = "52"

Test Code Output: SELECT COUNT(*) FROM Students WHERE NOT student_id IN (SELECT student_id FROM Student_Course_Enrolment)
Predicted Code Output: SELECT COUNT(*) FROM Students AS T1 JOIN Student_Course_Enrolment AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY COUNT(*) DESC LIMIT 1

Test Code Output: SELECT staten_island FROM table_1108394_6 WHERE the_bronx = "1,281"
Predicted Code Output: SELECT staten_island FROM table_1108394_6 WHERE the_bronx = "1,281"

Test Code Output: SELECT MAX(ends_lost) FROM table_name_11 WHERE locale = "ontario"
Predicted Code Output: SELECT MAX(ends_lost) FROM table_name_11 WHERE locale = "Ontario"

Test Code Output: SELECT cover_date FROM table_1217448_1 WHERE character_s_ = "X-Men ; Magneto"
Predicted Code Output: SELECT cover_date FROM table_1217448_1 WHERE character_s_ = "x-men"

Test Code Output: SELECT MAX(area_1996_km²) FROM table_name_91 WHERE pop_1999 = "17,510" AND area_2006_km² > 30
Predicted Code Output: SELECT area_1996_km2 FROM table_name_91 WHERE pop_1999 > 30 AND area_2006_km2 > 30

Test Code Output: SELECT T2.dept_name FROM student AS T1 JOIN department AS T2 ON T1.dept_code = T2.dept_code ORDER BY stu_gpa LIMIT 1
Predicted Code Output: SELECT T1.dept_name FROM student AS T1 JOIN department AS T2 ON T1.dept_code = T2.dept_code GROUP BY T1.dept_code

Test Code Output: SELECT network FROM table_28190363_1 WHERE judges = "Batuhan Zeynioğlu Piatti Murat Bozok Erol Kaynar"
Predicted Code Output: SELECT network FROM table_28190363_1 WHERE judges = "batuhan zeyniolu piatti murat bozok erol kaynar"

Test Code Output: SELECT dates_administered FROM table_20032301_3 WHERE poll_source = "Minnesota Poll"
Predicted Code Output: SELECT dates_administered FROM table_20032301_3 WHERE poll_source = "Minnesota Poll"

Test Code Output: SELECT MIN(overall) FROM table_name_58 WHERE school_club_team = "arizona state"
Predicted Code Output: SELECT COUNT(overall) FROM table_name_58 WHERE school_club_team = "arizona state"

Test Code Output: SELECT COUNT(*) FROM customers WHERE state = "CA"
Predicted Code Output: SELECT COUNT(*) FROM customers

Test Code Output: SELECT T2.customer_name FROM mailshot_customers AS T1 JOIN customers AS T2 ON T1.customer_id = T2.customer_id GROUP BY T1.customer_id ORDER BY COUNT(*) DESC LIMIT 1
Predicted Code Output: SELECT T1.customer_name FROM customers AS T1 JOIN mailshot_customers AS T2 ON T1.customer_id = T2.customer_id GROUP BY T1.customer_id ORDER BY COUNT(*) DESC LIMIT 1

Test Code Output: SELECT compatible_with_60gb_pal_80gb_ntsc_ps3__cechc_ceche_ FROM table_10875694_11 WHERE publisher = "Electronic Arts" AND title = "James Bond 007: Agent Under Fire"
Predicted Code Output: SELECT compatible_with_60gb_pal_80gb_ntsc_ps3__cechc_ceche_ FROM table_10875694_11 WHERE publisher = "James Bond 007: Agent Under Fire" AND title = "Agent Under Fire"

Test Code Output: SELECT result FROM table_12175755_1 WHERE theme = "Finale" AND order__number = "3"
Predicted Code Output: SELECT result FROM table_12175755_1 WHERE theme = "#3" AND order__number = "#4"

Test Code Output: SELECT track FROM table_28715942_5 WHERE vocal_percussionist = "unknown"
Predicted Code Output: SELECT track FROM table_28715942_5 WHERE vocal_percussionist = "unknown"

Test Code Output: SELECT COUNT(DISTINCT transaction_type_code) FROM TRANSACTIONS
Predicted Code Output: SELECT COUNT(transaction_type_code) FROM TRANSACTIONS

Test Code Output: SELECT COUNT(population_1891) FROM table_14925084_1 WHERE area_1891__statute_acres_ = 175836
Predicted Code Output: SELECT population_1891 FROM table_14925084_1 WHERE area_1891__statute_acres_ = "175836"

Test Code Output: SELECT COUNT(DISTINCT allergy) FROM Allergy_type
Predicted Code Output: SELECT COUNT(allergy) FROM Allergy_type

Test Code Output: SELECT t2.name, t2.capacity FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year > 2013 GROUP BY t2.stadium_id ORDER BY COUNT(*) DESC LIMIT 1
Predicted Code Output: SELECT T1.name, T1.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year = 2013

Test Code Output: SELECT rating / SHARE(18 - 49) FROM table_20522228_2 WHERE viewers__millions_ = "5.50"
Predicted Code Output: SELECT ratings FROM table_20522228_2 WHERE viewers__millions_ = "5.50 Million"

Test Code Output: SELECT college FROM table_14655757_1 WHERE player = "Byron Williams"
Predicted Code Output: SELECT college FROM table_14655757_1 WHERE player = "Byron Williams"

Test Code Output: SELECT Census_Ranking FROM city WHERE Status <> "Village"
Predicted Code Output: SELECT Census_Ranking FROM city WHERE Status = "Not Village"

Test Code Output: SELECT player FROM table_2886617_9 WHERE nhl_team = "St. Louis Blues"
Predicted Code Output: SELECT player FROM table_2886617_9 WHERE nhl_team = "St. Louis Blues"

Test Code Output: SELECT T1.White, T2.Crime_rate FROM city AS T1 JOIN county_public_safety AS T2 ON T1.County_ID = T2.County_ID
Predicted Code Output: SELECT T1.White FROM city AS T1 JOIN county_public_safety AS T2 ON T1.Crime_rate = T2.Crime_rate WHERE T2.County_ID = "White"

Test Code Output: SELECT MIN(tier) FROM table_name_68 WHERE postseason = "quarterfinalist"
Predicted Code Output: SELECT tier FROM table_name_68 WHERE postseason = "quarterfinalist"

Test Code Output: SELECT student_id FROM students WHERE NOT student_id IN (SELECT student_id FROM student_course_attendance)
Predicted Code Output: SELECT T1.student_id FROM students AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY COUNT(*) DESC LIMIT 1

Test Code Output: SELECT interview FROM table_11690135_1 WHERE evening_gown = "9.78"
Predicted Code Output: SELECT interview FROM table_11690135_1 WHERE evening_gown = "9.78"

Test Code Output: SELECT country FROM addresses GROUP BY country HAVING COUNT(address_id) > 4
Predicted Code Output: SELECT country FROM addresses WHERE address_id > 4

Test Code Output: SELECT COUNT(*) FROM store
Predicted Code Output: SELECT COUNT(*) FROM store

Test Code Output: SELECT DISTINCT T2.name FROM undergoes AS T1 JOIN nurse AS T2 ON T1.AssistingNurse = T2.EmployeeID
Predicted Code Output: SELECT T1.name FROM nurse AS T1 JOIN nurse AS T2 ON T1.EmployeeID = T2.AssistingNurse GROUP BY T1.EmployeeID

Test Code Output: SELECT T1.Color FROM GRAPES AS T1 JOIN WINE AS T2 ON T1.Grape = T2.Grape GROUP BY T2.Grape ORDER BY AVG(Price) DESC LIMIT 1
Predicted Code Output: SELECT COUNT(*) FROM GRAPES AS T1 JOIN WINE AS T2 ON T1.Color = T2.Grape WHERE T1.Color = "wine" AND T2.Grape = "wine"

Test Code Output: SELECT gender FROM table_28523_2 WHERE school = "Cunningham Hill Infant school"
Predicted Code Output: SELECT gender FROM table_28523_2 WHERE school = "Cunningham Hill Infant School"

Test Code Output: SELECT 1 AS st_leg FROM table_1233026_4 WHERE club = "A.C. Libertas"
Predicted Code Output: SELECT club FROM table_1233026_4 WHERE club = "a.c. libertas"

Test Code Output: SELECT high_assists FROM table_27723526_10 WHERE date = "January 27"
Predicted Code Output: SELECT high_assists FROM table_27723526_10 WHERE date = "january 27"

Test Code Output: SELECT name, price FROM products
Predicted Code Output: SELECT name, price FROM products WHERE price = "all"

Test Code Output: SELECT directed_by FROM table_26914076_4 WHERE us_viewers__millions_ = "0.57"
Predicted Code Output: SELECT directed_by FROM table_26914076_4 WHERE us_viewers__millions_ = "0.057"

Test Code Output: SELECT * FROM products AS T1 JOIN Manufacturers AS T2 ON T1.manufacturer = T2.code
Predicted Code Output: SELECT T1.manufacturer FROM products AS T1 JOIN manufacturers AS T2 ON T1.manufacturer = T2.manufacturer GROUP BY T1.manufacturer

Test Code Output: SELECT tournament FROM table_name_7 WHERE date = "october 1, 2006"
Predicted Code Output: SELECT tournament FROM table_name_7 WHERE date = "October 1, 2006"

Test Code Output: SELECT AVG(age), job FROM Person WHERE gender = 'male' GROUP BY job
Predicted Code Output: SELECT job FROM Person WHERE age = "Male" AND gender = "male"

Test Code Output: SELECT document_type_code FROM documents GROUP BY document_type_code HAVING COUNT(*) > 4
Predicted Code Output: SELECT document_type_code FROM documents WHERE document_type_code > 4

Test Code Output: SELECT T2.Name FROM phone_market AS T1 JOIN phone AS T2 ON T1.Phone_ID = T2.Phone_ID GROUP BY T2.Name HAVING SUM(T1.Num_of_stock) >= 2000 ORDER BY SUM(T1.Num_of_stock) DESC
Predicted Code Output: SELECT T1.Name FROM phone AS T1 JOIN phone_market AS T2 ON T1.Phone_ID = T2.Phone_ID GROUP BY T1.Phone_ID ORDER BY COUNT(*) DESC LIMIT 1

Test Code Output: SELECT date_of_appointment FROM table_27114708_2 WHERE team = "Ascoli"
Predicted Code Output: SELECT date_of_appointment FROM table_27114708_2 WHERE team = "Ascoli"

Test Code Output: SELECT high_assists FROM table_17288845_9 WHERE team = "Houston"
Predicted Code Output: SELECT high_assists FROM table_17288845_9 WHERE team = "houston"

Test Code Output: SELECT id FROM trip WHERE duration >= (SELECT AVG(duration) FROM trip WHERE zip_code = 94103)
Predicted Code Output: SELECT id FROM trip ORDER BY duration DESC LIMIT 1

Test Code Output: SELECT COUNT(DISTINCT driverId) FROM results WHERE NOT raceId IN (SELECT raceId FROM races WHERE YEAR <> 2009)
Predicted Code Output: SELECT T1.driverId FROM races AS T1 JOIN results AS T2 ON T1.driverId = T2.driverId WHERE T1.raceId = "2009" AND T2.year = "2009"

Test Code Output: SELECT race FROM table_27913160_3 WHERE most_laps_led = "Simon Pagenaud"
Predicted Code Output: SELECT race FROM table_27913160_3 WHERE most_laps_led = "Simon Pagenaud"

Test Code Output: SELECT AVG(total_amount_purchased), AVG(total_value_purchased) FROM Product_Suppliers WHERE supplier_id = (SELECT supplier_id FROM Product_Suppliers GROUP BY supplier_id ORDER BY COUNT(*) DESC LIMIT 1)
Predicted Code Output: SELECT average_amount_purchased, total_value_purchased FROM Product_Suppliers WHERE supplier_id = "The supplier who supplies the most products"

Test Code Output: SELECT MAX(points) FROM table_name_62 WHERE drawn = 0 AND games > 5
Predicted Code Output: SELECT points FROM table_name_62 WHERE drawn > 0 AND games > 5

Test Code Output: SELECT wednesday FROM table_18173916_8 WHERE thursday = "438 Magic: The Gathering Mini Masters Tournament"
Predicted Code Output: SELECT wednesday FROM table_18173916_8 WHERE thursday = "438 magic: the gathering mini masters tournament"

Test Code Output: SELECT T1.pName FROM player AS T1 JOIN tryout AS T2 ON T1.pID = T2.pID WHERE T2.decision = 'yes' AND T2.pPos = 'striker'
Predicted Code Output: SELECT T1.pName, T2.pPos FROM player AS T1 JOIN tryout AS T2 ON T1.pID = T2.pID GROUP BY T1.pID ORDER BY COUNT(*) DESC LIMIT 1

Test Code Output: SELECT gtu_winning_team FROM table_13642023_2 WHERE to_winning_team = "Steve Ross"
Predicted Code Output: SELECT gtu_winning_team FROM table_13642023_2 WHERE to_winning_team = "Steve Ross"

Test Code Output: SELECT T1.title, T3.name FROM course AS T1 JOIN teaches AS T2 ON T1.course_id = T2.course_id JOIN instructor AS T3 ON T2.id = T3.id WHERE YEAR = 2008 ORDER BY T1.title
Predicted Code Output: SELECT T1.name FROM course AS T1 JOIN instructor AS T2 ON T1.course_id = T2.course_id WHERE T1.id = "2008"

Test Code Output: SELECT T1.city FROM city AS T1 JOIN temperature AS T2 ON T1.city_id = T2.city_id WHERE T2.Mar < T2.Dec EXCEPT SELECT T3.city FROM city AS T3 JOIN hosting_city AS T4 ON T3.city_id = T4.host_city
Predicted Code Output: SELECT T1.city FROM city AS T1 JOIN hosting_city AS T2 ON T1.city_id = T2.city_id GROUP BY T2.city_id ORDER BY COUNT(*) DESC LIMIT 1

Test Code Output: SELECT cName FROM college WHERE enr > (SELECT MAX(enr) FROM college WHERE state = 'FL')
Predicted Code Output: SELECT cName FROM college ORDER BY state ORDER BY COUNT(*) DESC LIMIT 1

Test Code Output: SELECT DISTINCT Product_Name FROM PRODUCTS WHERE Product_Price > (SELECT AVG(Product_Price) FROM PRODUCTS)
Predicted Code Output: SELECT PRODUCT_Name FROM PRODUCTS WHERE Product_Price > (SELECT PRODUCT_Name FROM PRODUCTS)

Test Code Output: SELECT high_points FROM table_27902171_6 WHERE team = "Utah Jazz"
Predicted Code Output: SELECT high_points FROM table_27902171_6 WHERE team = "Utah Jazz"

Test Code Output: SELECT COUNT(*) FROM item WHERE NOT i_id IN (SELECT i_id FROM review)
Predicted Code Output: SELECT T1.i_id FROM review AS T1 JOIN item AS T2 ON T1.i_id = T2.i_id GROUP BY T1.i_id ORDER BY COUNT(*) DESC LIMIT 1

Test Code Output: SELECT MAX(founded) FROM table_2076516_1 WHERE school = "East Carolina University"
Predicted Code Output: SELECT COUNT(founded) FROM table_2076516_1 WHERE school = "East Carolina University"

Test Code Output: SELECT MAX(losses) FROM table_name_62 WHERE percentage > 0.461 AND wins > 86 AND finish = "2nd" AND year = 1953
Predicted Code Output: SELECT MAX(losses) FROM table_name_62 WHERE year = "1953" AND win = "2nd"

Test Code Output: SELECT COUNT(*), t1.name FROM manufacturer AS t1 JOIN furniture_manufacte AS t2 ON t1.manufacturer_id = t2.manufacturer_id GROUP BY t1.manufacturer_id
Predicted Code Output: SELECT T1.name FROM furniture_manufacte AS T1 JOIN manufacturer AS T2 ON T1.manufacturer_id = T2.manufacturer_id GROUP BY T1.name ORDER BY COUNT(*) DESC LIMIT 1

Test Code Output: SELECT MIN(loss) FROM table_name_83 WHERE avg_g = 3.5 AND gain < 42
Predicted Code Output: SELECT loss FROM table_name_83 WHERE avg_g = "3.5" AND gain = "42"

Test Code Output: SELECT T2.name, COUNT(*) FROM exhibition AS T1 JOIN artist AS T2 ON T1.artist_id = T2.artist_id GROUP BY T1.artist_id
Predicted Code Output: SELECT T1.name FROM artist AS T1 JOIN exhibition AS T2 ON T1.artist_id = T2.artist_id GROUP BY T1.artist_id ORDER BY COUNT(*) DESC LIMIT 1

Test Code Output: SELECT high_points FROM table_13812785_8 WHERE high_rebounds = "Charles Oakley (9)"
Predicted Code Output: SELECT high_points FROM table_13812785_8 WHERE high_rebounds = "Charles Oakley (9)"

Test Code Output: SELECT MAX(elevation) FROM airports WHERE country = 'Iceland'
Predicted Code Output: SELECT MAX(elevation) FROM airports WHERE country = "Iceland"

Test Code Output: SELECT MIN(games_played) FROM table_16034882_2
Predicted Code Output: SELECT MIN(games_played) FROM table_16034882_2 WHERE games_played = "0"

Test Code Output: SELECT t1.product_name, t1.typical_buying_price, t1.typical_selling_price FROM products AS t1 JOIN ref_colors AS t2 ON t1.color_code = t2.color_code WHERE t2.color_description = "yellow"
Predicted Code Output: SELECT T1.product_name, T1.typical_buying_price, T1.typical_selling_price FROM ref_colors AS T1 JOIN products AS T2 ON T1.color_code = T2.color_code WHERE T2.color_description = "yellow"

Test Code Output: SELECT t1.first_name FROM staff AS t1 JOIN complaints AS t2 ON t1.staff_id = t2.staff_id GROUP BY t2.staff_id ORDER BY COUNT(*) LIMIT 5
Predicted Code Output: SELECT T1.first_name FROM complaints AS T1 JOIN staff AS T2 ON T1.staff_id = T2.staff_id GROUP BY T1.staff_id ORDER BY COUNT(*) DESC LIMIT 1

Test Code Output: SELECT founder FROM manufacturers WHERE name = 'Sony'
Predicted Code Output: SELECT founder FROM manufacturers WHERE name = "Sony"

Test Code Output: SELECT player FROM table_name_98 WHERE club = "balmain tigers"
Predicted Code Output: SELECT player FROM table_name_98 WHERE club = "Balmain Tigers"

Test Code Output: SELECT MIN(no_in_series) FROM table_2618102_1 WHERE directed_by = "James Quinn"
Predicted Code Output: SELECT MIN(no_in_series) FROM table_2618102_1 WHERE directed_by = "James Quinn"

Test Code Output: SELECT to_par FROM table_247955_2 WHERE winning_score = 69 - 66 - 69 - 64 = 268
Predicted Code Output: SELECT to_par FROM table_247955_2 WHERE winning_score = "69-66-69-64=268"


In [ ]:
Test_list=y_test[:500].tolist()
Outputlist=predicted_code

In [ ]:
testlist=pd.DataFrame(Test_list)
outputlist=pd.DataFrame(Outputlist)

In [ ]:
pip install rapidfuzz

Collecting rapidfuzz
  Using cached rapidfuzz-3.10.1-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (11 kB)
Using cached rapidfuzz-3.10.1-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (3.1 MB)
Installing collected packages: rapidfuzz
Successfully installed rapidfuzz-3.10.1

In [ ]:
from rapidfuzz import fuzz
total=0
for i in range(0,500):
  result=fuzz.ratio(testlist[0][i],outputlist[0][i])
  total=total+result

print(total/500)

86.84779392126414

In [ ]:
pip install rouge-score

Collecting rouge-score
  Downloading rouge_score-0.1.2.tar.gz (17 kB)
  Preparing metadata (setup.py) ... done
Requirement already satisfied: absl-py in /usr/local/lib/python3.10/dist-packages (from rouge-score) (1.4.0)
Requirement already satisfied: nltk in /usr/local/lib/python3.10/dist-packages (from rouge-score) (3.9.1)
Requirement already satisfied: numpy in /usr/local/lib/python3.10/dist-packages (from rouge-score) (1.26.4)
Requirement already satisfied: six>=1.14.0 in /usr/local/lib/python3.10/dist-packages (from rouge-score) (1.16.0)
Requirement already satisfied: click in /usr/local/lib/python3.10/dist-packages (from nltk->rouge-score) (8.1.7)
Requirement already satisfied: joblib in /usr/local/lib/python3.10/dist-packages (from nltk->rouge-score) (1.4.2)
Requirement already satisfied: regex>=2021.8.3 in /usr/local/lib/python3.10/dist-packages (from nltk->rouge-score) (2024.9.11)
Requirement already satisfied: tqdm in /usr/local/lib/python3.10/dist-packages (from nltk->rouge-score) (4.66.6)
Building wheels for collected packages: rouge-score
  Building wheel for rouge-score (setup.py) ... done
  Created wheel for rouge-score: filename=rouge_score-0.1.2-py3-none-any.whl size=24935 sha256=c55c41aeeed5da9e2081a79e88e19db53f762e6d2e578bbdac636527a29c5b56
  Stored in directory: /root/.cache/pip/wheels/5f/dd/89/461065a73be61a532ff8599a28e9beef17985c9e9c31e541b4
Successfully built rouge-score
Installing collected packages: rouge-score
Successfully installed rouge-score-0.1.2

In [ ]:
from rouge_score import rouge_scorer

scorer = rouge_scorer.RougeScorer(['rouge1', 'rouge2', 'rougeL'], use_stemmer=False)
R1=[]
R2=[]
RL=[]
for i in range(0,500):
  scores = scorer.score(Test_list[i], Outputlist[i])
  R1.append(scores['rouge1'].fmeasure)
  R2.append(scores['rouge2'].fmeasure)
  RL.append(scores['rougeL'].fmeasure)

for i in range(0,10):
  sum_R1=sum(R1)
  sum_R2=sum(R2)
  sum_RL=sum(RL)

print('Rouge1 Score: '+str(sum_R1/500))
print('Rouge2 Score: '+str(sum_R2/500))
print('RougeL Score: '+str(sum_RL/500))

Rouge1 Score: 0.8732782169120589
Rouge2 Score: 0.7864498523807367
RougeL Score: 0.8523645264523053

In [ ]:
from nltk.translate.bleu_score import sentence_bleu, SmoothingFunction
bleu=[]
for i in range(0,500):
  reference_tokens = [Test_list[i].split()]
  generated_tokens = Outputlist[i].split()
  smoothing = SmoothingFunction().method2
  bleu_score = sentence_bleu(reference_tokens, generated_tokens, smoothing_function=smoothing)
  bleu.append(bleu_score)

sum_bleu=(sum(bleu))/500
print(f"BLEU Score: {sum_bleu:.4f}")

BLEU Score: 0.6295

In [ ]:
#References:
#[1].T5. (n.d.). https://huggingface.co/docs/transformers/en/model_doc/t5
#[2].Papers with Code - Exploring the Limits of Transfer Learning with a Unified Text-to-Text Transformer. (2019, October 23). https://paperswithcode.com/paper/exploring-the-limits-of-transfer-learning#code
#[3].Isaacndirangumuturi. (2023, October 5). Code Generation with T5 Transformer. Kaggle. https://www.kaggle.com/code/isaacndirangumuturi/code-generation-with-t5-transformer
#[4].b-mc2/sql-create-context · Datasets at Hugging Face. (2001, May 12). https://huggingface.co/datasets/b-mc2/sql-create-context?row=0